{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a5a5e9d2-2bce-4c4b-9a1c-b3dfbaf519a7",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "71c32561",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection Pool Created\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%load_ext ngql\n",
    "%ngql --address 127.0.0.1 --port 9669 --user root --password nebula\n",
    "%ngql USE demo_basketballplayer"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5f9660ea",
   "metadata": {},
   "source": [
    "## Demo. 画像、关系生成 Profile/Linkage Generation\n",
    "\n",
    "### 1. 图建模与数据构造"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5127cf14",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%ngql\n",
    "CREATE SPACE `operator_biz` (partition_num = 1, replica_factor = 1, vid_type = FIXED_STRING(128));"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "62211914",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ngql USE operator_biz"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "064520bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%ngql\n",
    "CREATE TAG `profile` (`name` string NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"画像\";\n",
    "CREATE TAG `device` ( `IMEI` string NOT NULL, `model` string NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"设备\";\n",
    "CREATE TAG `device_model` ( `name` string NOT NULL, `price` float NOT NULL, `release_date` date NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"设备型号\";\n",
    "CREATE TAG `place` ( `geo_point` geography(point) NOT NULL, `name` string NULL, `city` string NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"地点\";\n",
    "CREATE TAG `place_category` (`name` string NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"地点类别\";\n",
    "CREATE TAG `product_category` ( `name` string NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"消费品类别\";\n",
    "CREATE TAG `subscriber` ( `msisdn` int64 NOT NULL, `name` string NOT NULL, `birth` date NOT NULL) ttl_duration = 0, ttl_col = \"\";\n",
    "CREATE EDGE `was` (`time` datetime NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"是\";\n",
    "CREATE EDGE `is_categorized_as` () ttl_duration = 0, ttl_col = \"\", comment = \"归类为\";\n",
    "CREATE EDGE `owned_device` ( `time` datetime NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"使用过设备\";\n",
    "CREATE EDGE `place_categorized_as` () ttl_duration = 0, ttl_col = \"\", comment = \"地点归类\";\n",
    "CREATE EDGE `stays_in` ( `time` datetime NOT NULL) ttl_duration = 0, ttl_col = \"\", comment = \"停留\";\n",
    "CREATE EDGE `with_model` () ttl_duration = 0, ttl_col = \"\", comment = \"型号为\";\n",
    "CREATE EDGE `in_region_of` () ttl_duration = 0, ttl_col = \"\", comment = \"在区域内\";"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ef775ba7",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%ngql\n",
    "# Create Index\n",
    "CREATE TAG INDEX IF NOT EXISTS any_shape_geo_index ON place(geo_point);\n",
    "CREATE TAG INDEX IF NOT EXISTS subscriber_index ON subscriber(msisdn);\n",
    "CREATE TAG INDEX IF NOT EXISTS subscriber_index ON subscriber(birth);\n",
    "CREATE TAG INDEX IF NOT EXISTS profile_index ON `profile`(`name`(128));"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "97be1701",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "\n",
    "INSERT VERTEX subscriber (msisdn, name, birth) VALUES\n",
    "    \"sub-0\":(13900000001, \"Tom Smith\", date(\"1998-03-17\")),\n",
    "    \"sub-1\":(13900000002, \"Emma Smith\", date(\"1998-11-15\")),\n",
    "    \"sub-2\":(13900000003, \"Liam Johnson\", date(\"2001-07-03\")),\n",
    "    \"sub-3\":(13900000004, \"Olivia Brown\", date(\"1999-12-28\")),\n",
    "    \"sub-4\":(13900000005, \"Noah Davis\", date(\"2000-03-10\")),\n",
    "    \"sub-5\":(13900000006, \"Ava Wilson\", date(\"1997-09-05\")),\n",
    "    \"sub-6\":(13900000007, \"Sophia Taylor\", date(\"1999-02-21\")),\n",
    "    \"sub-7\":(13900000008, \"Jackson Anderson\", date(\"1998-06-12\")),\n",
    "    \"sub-8\":(13900000009, \"Isabella Martinez\", date(\"1997-10-09\")),\n",
    "    \"sub-9\":(13900000010, \"Aiden Thompson\", date(\"1996-04-17\")),\n",
    "    \"sub-10\":(13900000011, \"Mia Garcia\", date(\"1995-08-25\"));\n",
    "\n",
    "INSERT VERTEX device_model (name, price, release_date) VALUES\n",
    "    \"model-0\":(\"iPhone 6\", 999.0, date(\"2014-09-19\")),\n",
    "    \"model-1\":(\"iPhone 7\", 1999.0, date(\"2016-09-16\")),\n",
    "    \"model-2\":(\"iPhone 8\", 2999.0, date(\"2017-09-22\")),\n",
    "    \"model-3\":(\"iPhone X\", 3999.0, date(\"2017-11-03\")),\n",
    "    \"model-4\":(\"iPhone 11\", 4999.0, date(\"2019-09-20\")),\n",
    "    \"model-5\":(\"RedMi 6\", 999.0, date(\"2018-06-12\")),\n",
    "    \"model-6\":(\"RedMi 7\", 1299.0, date(\"2019-03-18\")),\n",
    "    \"model-7\":(\"RedMi 8\", 1499.0, date(\"2019-09-24\")),\n",
    "    \"model-8\":(\"RedMi 9\", 1699.0, date(\"2020-06-12\"));\n",
    "\n",
    "# device and device_model, with model from iPhone 6 to iPhone 11 and RedMi 6 to RedMi 9, imei is random generated\n",
    "\n",
    "INSERT VERTEX device (IMEI, model) VALUES\n",
    "    \"device-0\":(\"123456789012345\", \"iPhone 6\"),\n",
    "    \"device-1\":(\"123456789012346\", \"iPhone 7\"),\n",
    "    \"device-2\":(\"123456789012347\", \"iPhone 8\"),\n",
    "    \"device-3\":(\"123456789012348\", \"iPhone X\"),\n",
    "    \"device-4\":(\"123456789012349\", \"iPhone 11\"),\n",
    "    \"device-5\":(\"123456789012350\", \"RedMi 6\"),\n",
    "    \"device-6\":(\"123456789012351\", \"RedMi 7\"),\n",
    "    \"device-7\":(\"123456789012352\", \"RedMi 8\"),\n",
    "    \"device-8\":(\"123456789012353\", \"RedMi 9\");\n",
    "\n",
    "INSERT EDGE with_model () VALUES\n",
    "    \"device-0\"->\"model-0\":(),\n",
    "    \"device-1\"->\"model-1\":(),\n",
    "    \"device-2\"->\"model-2\":(),\n",
    "    \"device-3\"->\"model-3\":(),\n",
    "    \"device-4\"->\"model-4\":(),\n",
    "    \"device-5\"->\"model-5\":(),\n",
    "    \"device-6\"->\"model-6\":(),\n",
    "    \"device-7\"->\"model-7\":(),\n",
    "    \"device-8\"->\"model-8\":();\n",
    "\n",
    "# Those device-models current price lower than 2000 are categorized as \"Cost-effective Product\", above 2000 are categorized as \"High-end Product\"\n",
    "\n",
    "INSERT VERTEX product_category (name) VALUES\n",
    "    \"category-0\":(\"Cost-effective Product\"),\n",
    "    \"category-1\":(\"High-end Product\");\n",
    "\n",
    "\n",
    "INSERT EDGE is_categorized_as () VALUES\n",
    "    \"model-0\"->\"category-0\":(),\n",
    "    \"model-1\"->\"category-0\":(),\n",
    "    \"model-2\"->\"category-0\":(),\n",
    "    \"model-3\"->\"category-1\":(),\n",
    "    \"model-4\"->\"category-1\":(),\n",
    "    \"model-5\"->\"category-0\":(),\n",
    "    \"model-6\"->\"category-0\":(),\n",
    "    \"model-7\"->\"category-0\":(),\n",
    "    \"model-8\"->\"category-0\":();\n",
    "\n",
    "# 高校与CBD办公地点\n",
    "# Those places are categorized as \"University\" if it is a university, \"CBD\" if it is a CBD office building\n",
    "\n",
    "INSERT VERTEX place_category (name) VALUES\n",
    "    \"place-category-0\":(\"University\"),\n",
    "    \"place-category-1\":(\"CBD\");\n",
    "\n",
    "# 上海的高校、CBD\n",
    "# 复旦大学 31.2974° N, 121.5036° E\n",
    "# 上交大 31.0252° N, 121.4338° E\n",
    "# 华东师范大学 31.2261° N, 121.4376° E\n",
    "# 同济 31.2859° N, 121.5098° E\n",
    "# 金茂大厦 31.2353° N, 121.5057° E\n",
    "\n",
    "INSERT VERTEX place (geo_point, name, city) VALUES\n",
    "    \"place-0\":(ST_GeogFromText(\"POINT (121.5036 31.2974)\"), \"Fudan University\", \"Shanghai\"),\n",
    "    \"place-1\":(ST_GeogFromText(\"POINT (121.4338 31.0252)\"), \"Shanghai Jiao Tong University\", \"Shanghai\"),\n",
    "    \"place-2\":(ST_GeogFromText(\"POINT (121.4376 31.2261)\"), \"East China Normal University\", \"Shanghai\"),\n",
    "    \"place-3\":(ST_GeogFromText(\"POINT (121.5098 31.2859)\"), \"Tongji University\", \"Shanghai\"),\n",
    "    \"place-4\":(ST_GeogFromText(\"POINT (121.5057 31.2353)\"), \"Jinmao Building\", \"Shanghai\");\n",
    "\n",
    "# Mock places without name, that are 0.5km away from places above\n",
    "\n",
    "INSERT VERTEX place (geo_point, name, city) VALUES\n",
    "    \"place-10\":(ST_GeogFromText(\"POINT (121.503517 31.298134)\"), \"\", \"Shanghai\"),\n",
    "    \"place-11\":(ST_GeogFromText(\"POINT (121.503617 31.297431)\"), \"\", \"Shanghai\"),\n",
    "    \"place-12\":(ST_GeogFromText(\"POINT (121.433813 31.025131)\"), \"\", \"Shanghai\"),\n",
    "    \"place-13\":(ST_GeogFromText(\"POINT (121.433813 31.025331)\"), \"\", \"Shanghai\"),\n",
    "    \"place-14\":(ST_GeogFromText(\"POINT (121.437613 31.226031)\"), \"\", \"Shanghai\"),\n",
    "    \"place-15\":(ST_GeogFromText(\"POINT (121.437613 31.226231)\"), \"\", \"Shanghai\"),\n",
    "    \"place-16\":(ST_GeogFromText(\"POINT (121.509813 31.285831)\"), \"\", \"Shanghai\"),\n",
    "    \"place-17\":(ST_GeogFromText(\"POINT (121.509813 31.286031)\"), \"\", \"Shanghai\"),\n",
    "    \"place-18\":(ST_GeogFromText(\"POINT (121.505123 31.235231)\"), \"\", \"Shanghai\"),\n",
    "    \"place-19\":(ST_GeogFromText(\"POINT (121.506163 31.235431)\"), \"\", \"Shanghai\");\n",
    "\n",
    "\n",
    "INSERT EDGE place_categorized_as () VALUES\n",
    "    \"place-0\"->\"place-category-0\":(),\n",
    "    \"place-1\"->\"place-category-0\":(),\n",
    "    \"place-2\"->\"place-category-0\":(),\n",
    "    \"place-3\"->\"place-category-0\":(),\n",
    "    \"place-4\"->\"place-category-1\":();\n",
    "\n",
    "INSERT VERTEX profile (name) VALUES\n",
    "    \"profile-0\":(\"Student\"),\n",
    "    \"profile-1\":(\"C9\"),\n",
    "    \"profile-2\":(\"Student Smart Phone\"),\n",
    "    \"profile-3\":(\"Potential High-end Consumer\");\n",
    "\n",
    "INSERT EDGE owned_device (`time`) VALUES\n",
    "    \"sub-0\"->\"device-0\":(datetime(\"2023-06-01 12:00:00\")),\n",
    "    \"sub-1\"->\"device-1\":(datetime(\"2023-06-11 13:01:30\")),\n",
    "    \"sub-2\"->\"device-2\":(datetime(\"2023-06-21 14:03:00\")),\n",
    "    \"sub-3\"->\"device-3\":(datetime(\"2023-06-02 15:04:30\")),\n",
    "    \"sub-4\"->\"device-4\":(datetime(\"2023-06-12 16:06:00\")),\n",
    "    \"sub-5\"->\"device-5\":(datetime(\"2023-06-22 17:07:30\")),\n",
    "    \"sub-6\"->\"device-6\":(datetime(\"2023-06-03 18:09:00\")),\n",
    "    \"sub-7\"->\"device-7\":(datetime(\"2023-06-13 19:10:30\")),\n",
    "    \"sub-8\"->\"device-8\":(datetime(\"2023-06-23 20:12:00\")),\n",
    "    \"sub-9\"->\"device-0\":(datetime(\"2023-06-04 21:13:30\")),\n",
    "    \"sub-10\"->\"device-1\":(datetime(\"2023-06-14 22:15:00\"));\n",
    "\n",
    "# 年轻的人在学校，年长的人在CBD，时间是2023年6月份\n",
    "\n",
    "INSERT EDGE stays_in (`time`) VALUES\n",
    "    \"sub-0\"->\"place-10\":(datetime(\"2023-06-01 12:00:00\")),\n",
    "    \"sub-1\"->\"place-11\":(datetime(\"2023-06-11 13:01:30\")),\n",
    "    \"sub-2\"->\"place-12\":(datetime(\"2023-06-21 14:03:00\")),\n",
    "    \"sub-3\"->\"place-13\":(datetime(\"2023-06-02 15:04:30\")),\n",
    "    \"sub-4\"->\"place-14\":(datetime(\"2023-06-12 16:06:00\")),\n",
    "    \"sub-5\"->\"place-15\":(datetime(\"2023-06-22 17:07:30\")),\n",
    "    \"sub-6\"->\"place-15\":(datetime(\"2023-06-03 18:09:00\")),\n",
    "    \"sub-7\"->\"place-16\":(datetime(\"2023-06-13 19:10:30\")),\n",
    "    \"sub-8\"->\"place-17\":(datetime(\"2023-06-23 20:12:00\")),\n",
    "    \"sub-9\"->\"place-18\":(datetime(\"2023-06-04 21:13:30\")),\n",
    "    \"sub-9\"->\"place-17\":(datetime(\"2022-06-04 21:13:30\")),\n",
    "    \"sub-10\"->\"place-19\":(datetime(\"2023-06-14 22:15:00\")),\n",
    "    \"sub-10\"->\"place-10\":(datetime(\"2022-06-14 21:11:00\"));\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "353bf18d",
   "metadata": {},
   "source": [
    "### 2. 画像、关系生成\n",
    "\n",
    "\n",
    "- 当前价格低于 2000 的手机为高性价比手机\n",
    "- 小于30岁的 subscriber ，如果在学校，那么他们是学生;\n",
    "- 在复旦大学、上海交通大学的学生是 C9高校画像;\n",
    "- 使用高性价比手机的学生，那么他们是学生智能画像;\n",
    "- 拥有学生智能画像与 C9高校画像，那么他们是潜在高消费用户画像\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bfec1ee3",
   "metadata": {},
   "source": [
    "#### 2.1 新标签：当前价格低于 2000 的手机为高性价比手机"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f117cd35",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>model_name</th>\n",
       "      <th>price_now</th>\n",
       "      <th>is_cost_effective_product</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-0</td>\n",
       "      <td>Tom Smith</td>\n",
       "      <td>iPhone 6</td>\n",
       "      <td>999.0</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      id       name model_name  price_now  is_cost_effective_product\n",
       "0  sub-0  Tom Smith   iPhone 6      999.0                       True"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH (sub:subscriber{name: \"Tom Smith\"})-[:owned_device]->(:device)-[:with_model]->(model:device_model)\n",
    "    WHERE model.device_model.price < 2000\n",
    "RETURN id(sub) AS id, properties(sub).name AS name,\n",
    "    model.device_model.name AS model_name,\n",
    "    model.device_model.price AS price_now,\n",
    "    (model.device_model.price < 2000) AS is_cost_effective_product;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "f9ece0a8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "# Those device-models current price lower than 2000 are categorized as \"Cost-effective Product\", above 2000 are categorized as \"High-end Product\"\n",
    "# INSERT VERTEX product_category (name) VALUES\n",
    "#     \"category-0\":(\"Cost-effective Product\"),\n",
    "#     \"category-1\":(\"High-end Product\");\n",
    "\n",
    "INSERT EDGE is_categorized_as () VALUES\n",
    "    \"model-0\"->\"category-0\":(),\n",
    "    \"model-1\"->\"category-0\":(),\n",
    "    \"model-2\"->\"category-0\":(),\n",
    "    \"model-3\"->\"category-1\":(),\n",
    "    \"model-4\"->\"category-1\":(),\n",
    "    \"model-5\"->\"category-0\":(),\n",
    "    \"model-6\"->\"category-0\":(),\n",
    "    \"model-7\"->\"category-0\":(),\n",
    "    \"model-8\"->\"category-0\":();"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a897f1a6-be1d-4d6a-ac90-03c16023ea07",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"sub-0\" :subscriber{msisdn: 13900000001, name...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   p\n",
       "0  (\"sub-0\" :subscriber{msisdn: 13900000001, name..."
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH p=(sub:subscriber{name: \"Tom Smith\"})-[:owned_device]->(:device)-[:with_model]->(model:device_model)\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "26f49017-713f-4b42-91e5-7806014638e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f90c5ce4e20>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "45ab358e-12e8-4eb7-8d7f-59844c2dc47a",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_2.1.html"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "18f74de9",
   "metadata": {},
   "source": [
    "\n",
    "#### 2.2 画像：小于30岁的 subscriber ，如果在（复旦）大学附近，那么他们是学生;\n",
    "\n",
    "```cypher\n",
    "MATCH (sub:subscriber)-[:stays_in]->(place:place)\n",
    "WHERE (\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5036 31.2974)\")\n",
    "                ) < 500\n",
    "                OR\n",
    "    place.place.name == \"Fudan University\")\n",
    "        AND\n",
    "    sub.subscriber.birth > date(\"1998-12-31\")\n",
    "RETURN id(sub) AS id, sub.subscriber.name AS name, sub.subscriber.birth AS birth,\n",
    "    \"Student\" AS profile\n",
    "\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "daacdfb7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div style=\"width:100%;\"><div style=\"position:relative;width:100%;height:0;padding-bottom:60%;\"><span style=\"color:#565656\">Make this Notebook Trusted to load map: File -> Trust Notebook</span><iframe srcdoc=\"&lt;!DOCTYPE html&gt;\n",
       "&lt;html&gt;\n",
       "&lt;head&gt;\n",
       "    \n",
       "    &lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=UTF-8&quot; /&gt;\n",
       "    \n",
       "        &lt;script&gt;\n",
       "            L_NO_TOUCH = false;\n",
       "            L_DISABLE_3D = false;\n",
       "        &lt;/script&gt;\n",
       "    \n",
       "    &lt;style&gt;html, body {width: 100%;height: 100%;margin: 0;padding: 0;}&lt;/style&gt;\n",
       "    &lt;style&gt;#map {position:absolute;top:0;bottom:0;right:0;left:0;}&lt;/style&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://code.jquery.com/jquery-1.12.4.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/js/bootstrap.bundle.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/@fortawesome/fontawesome-free@6.2.0/css/all.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/gh/python-visualization/folium/folium/templates/leaflet.awesome.rotate.min.css&quot;/&gt;\n",
       "    \n",
       "            &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width,\n",
       "                initial-scale=1.0, maximum-scale=1.0, user-scalable=no&quot; /&gt;\n",
       "            &lt;style&gt;\n",
       "                #map_db0afcb081ddd8571f4d3232f8e9a225 {\n",
       "                    position: relative;\n",
       "                    width: 100.0%;\n",
       "                    height: 100.0%;\n",
       "                    left: 0.0%;\n",
       "                    top: 0.0%;\n",
       "                }\n",
       "                .leaflet-container { font-size: 1rem; }\n",
       "            &lt;/style&gt;\n",
       "        \n",
       "&lt;/head&gt;\n",
       "&lt;body&gt;\n",
       "    \n",
       "    \n",
       "            &lt;div class=&quot;folium-map&quot; id=&quot;map_db0afcb081ddd8571f4d3232f8e9a225&quot; &gt;&lt;/div&gt;\n",
       "        \n",
       "&lt;/body&gt;\n",
       "&lt;script&gt;\n",
       "    \n",
       "    \n",
       "            var map_db0afcb081ddd8571f4d3232f8e9a225 = L.map(\n",
       "                &quot;map_db0afcb081ddd8571f4d3232f8e9a225&quot;,\n",
       "                {\n",
       "                    center: [31.2353, 121.5057],\n",
       "                    crs: L.CRS.EPSG3857,\n",
       "                    zoom: 13,\n",
       "                    zoomControl: true,\n",
       "                    preferCanvas: false,\n",
       "                }\n",
       "            );\n",
       "\n",
       "            \n",
       "\n",
       "        \n",
       "    \n",
       "            var tile_layer_fe1554e58f1323bff8306f19e9f94260 = L.tileLayer(\n",
       "                &quot;https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png&quot;,\n",
       "                {&quot;attribution&quot;: &quot;Data by \\u0026copy; \\u003ca target=\\&quot;_blank\\&quot; href=\\&quot;http://openstreetmap.org\\&quot;\\u003eOpenStreetMap\\u003c/a\\u003e, under \\u003ca target=\\&quot;_blank\\&quot; href=\\&quot;http://www.openstreetmap.org/copyright\\&quot;\\u003eODbL\\u003c/a\\u003e.&quot;, &quot;detectRetina&quot;: false, &quot;maxNativeZoom&quot;: 18, &quot;maxZoom&quot;: 18, &quot;minZoom&quot;: 0, &quot;noWrap&quot;: false, &quot;opacity&quot;: 1, &quot;subdomains&quot;: &quot;abc&quot;, &quot;tms&quot;: false}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var circle_f78c218126efdc9dad33140c9f41139e = L.circle(\n",
       "                [31.2974, 121.5036],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;blue&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: true, &quot;fillColor&quot;: &quot;#3186cc&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;opacity&quot;: 1.0, &quot;radius&quot;: 1000, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var circle_0aca05b28efd78ad7e1823501c45be48 = L.circle(\n",
       "                [31.0252, 121.4338],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;blue&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: true, &quot;fillColor&quot;: &quot;#3186cc&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;opacity&quot;: 1.0, &quot;radius&quot;: 1000, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var circle_87c8b1afe656e3a7f8a997cbbec8ec43 = L.circle(\n",
       "                [31.2261, 121.4376],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;blue&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: true, &quot;fillColor&quot;: &quot;#3186cc&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;opacity&quot;: 1.0, &quot;radius&quot;: 1000, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var circle_0fdb75d20af396e18a497ee4b165e623 = L.circle(\n",
       "                [31.2859, 121.5098],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;blue&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: true, &quot;fillColor&quot;: &quot;#3186cc&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;opacity&quot;: 1.0, &quot;radius&quot;: 1000, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var circle_dfebdd43f2ef8f2e585c825c917d8c09 = L.circle(\n",
       "                [31.2353, 121.5057],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;blue&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: true, &quot;fillColor&quot;: &quot;#3186cc&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;opacity&quot;: 1.0, &quot;radius&quot;: 1000, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var marker_f490d3a9ff2ec50ed3a96828d04c1472 = L.marker(\n",
       "                [31.298134, 121.503517],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_dacaa359453ad466cb44bb3b03be8b03 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_f490d3a9ff2ec50ed3a96828d04c1472.setIcon(icon_dacaa359453ad466cb44bb3b03be8b03);\n",
       "        \n",
       "    \n",
       "        var popup_b4410b7a7caca6ea67371458f1854d42 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_4d0d8f03f440f184e070d34f67a57466 = $(`&lt;div id=&quot;html_4d0d8f03f440f184e070d34f67a57466&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-0&lt;/div&gt;`)[0];\n",
       "                popup_b4410b7a7caca6ea67371458f1854d42.setContent(html_4d0d8f03f440f184e070d34f67a57466);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_f490d3a9ff2ec50ed3a96828d04c1472.bindPopup(popup_b4410b7a7caca6ea67371458f1854d42)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_36b583f79629c313bbbef7689936fbeb = L.marker(\n",
       "                [31.297431, 121.503617],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_cf38ee827bb1923291254d1f3e850dbc = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_36b583f79629c313bbbef7689936fbeb.setIcon(icon_cf38ee827bb1923291254d1f3e850dbc);\n",
       "        \n",
       "    \n",
       "        var popup_05221d4ca912d06e268c3701cb31db94 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_ebbda6868af9e76a11a8e2b9ac3ed6bd = $(`&lt;div id=&quot;html_ebbda6868af9e76a11a8e2b9ac3ed6bd&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-1&lt;/div&gt;`)[0];\n",
       "                popup_05221d4ca912d06e268c3701cb31db94.setContent(html_ebbda6868af9e76a11a8e2b9ac3ed6bd);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_36b583f79629c313bbbef7689936fbeb.bindPopup(popup_05221d4ca912d06e268c3701cb31db94)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_7d9859b3200c0ac45d52b6ab0cb56b68 = L.marker(\n",
       "                [31.025131, 121.433813],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_5f27e775d1e6c976bbc8f56fca6f9d6a = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_7d9859b3200c0ac45d52b6ab0cb56b68.setIcon(icon_5f27e775d1e6c976bbc8f56fca6f9d6a);\n",
       "        \n",
       "    \n",
       "        var popup_4fe9d236be7c20d9ca3412c4ffee25e9 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_1454912aab970764aef5fda10c4c1030 = $(`&lt;div id=&quot;html_1454912aab970764aef5fda10c4c1030&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-2&lt;/div&gt;`)[0];\n",
       "                popup_4fe9d236be7c20d9ca3412c4ffee25e9.setContent(html_1454912aab970764aef5fda10c4c1030);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_7d9859b3200c0ac45d52b6ab0cb56b68.bindPopup(popup_4fe9d236be7c20d9ca3412c4ffee25e9)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_3338887bf7f7f30b03e6162a18b0a187 = L.marker(\n",
       "                [31.025331, 121.433813],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_d0b8e9ad02ac17f6a4141d28aa775a85 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_3338887bf7f7f30b03e6162a18b0a187.setIcon(icon_d0b8e9ad02ac17f6a4141d28aa775a85);\n",
       "        \n",
       "    \n",
       "        var popup_c37cbe63b349f35688f874edd890573e = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_d69f7a5b148a09b2708ab51ad5c4e035 = $(`&lt;div id=&quot;html_d69f7a5b148a09b2708ab51ad5c4e035&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-3&lt;/div&gt;`)[0];\n",
       "                popup_c37cbe63b349f35688f874edd890573e.setContent(html_d69f7a5b148a09b2708ab51ad5c4e035);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_3338887bf7f7f30b03e6162a18b0a187.bindPopup(popup_c37cbe63b349f35688f874edd890573e)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_3e581ddfc1247b580f1876953f5c1365 = L.marker(\n",
       "                [31.226031, 121.437613],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_a4f10560fe37a37c6cb1709d8747c892 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_3e581ddfc1247b580f1876953f5c1365.setIcon(icon_a4f10560fe37a37c6cb1709d8747c892);\n",
       "        \n",
       "    \n",
       "        var popup_d285e04ba3f6f74a7fe80de98745c0b4 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_e46c4d15e3281ebd891b4894a720a79e = $(`&lt;div id=&quot;html_e46c4d15e3281ebd891b4894a720a79e&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-4&lt;/div&gt;`)[0];\n",
       "                popup_d285e04ba3f6f74a7fe80de98745c0b4.setContent(html_e46c4d15e3281ebd891b4894a720a79e);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_3e581ddfc1247b580f1876953f5c1365.bindPopup(popup_d285e04ba3f6f74a7fe80de98745c0b4)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_2931aadfdf154758050e5dd95cef58fb = L.marker(\n",
       "                [31.226231, 121.437613],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_97c647536b49a744ac9d64f7c51f9249 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_2931aadfdf154758050e5dd95cef58fb.setIcon(icon_97c647536b49a744ac9d64f7c51f9249);\n",
       "        \n",
       "    \n",
       "        var popup_3e08d8bbd2ef800b1163ac318c739837 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_f5a2a93f07af61102de84c860d7d5988 = $(`&lt;div id=&quot;html_f5a2a93f07af61102de84c860d7d5988&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-5&lt;/div&gt;`)[0];\n",
       "                popup_3e08d8bbd2ef800b1163ac318c739837.setContent(html_f5a2a93f07af61102de84c860d7d5988);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_2931aadfdf154758050e5dd95cef58fb.bindPopup(popup_3e08d8bbd2ef800b1163ac318c739837)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_17da64f7d8d4731393fd34c7ab68fa72 = L.marker(\n",
       "                [31.226231, 121.437613],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_cdb36e453e2277d7b9011cdfae2dd50f = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_17da64f7d8d4731393fd34c7ab68fa72.setIcon(icon_cdb36e453e2277d7b9011cdfae2dd50f);\n",
       "        \n",
       "    \n",
       "        var popup_93fbfec6754ca55cf7e570103c59a7ab = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_719147c84729db9d385dd4bc41338a02 = $(`&lt;div id=&quot;html_719147c84729db9d385dd4bc41338a02&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-6&lt;/div&gt;`)[0];\n",
       "                popup_93fbfec6754ca55cf7e570103c59a7ab.setContent(html_719147c84729db9d385dd4bc41338a02);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_17da64f7d8d4731393fd34c7ab68fa72.bindPopup(popup_93fbfec6754ca55cf7e570103c59a7ab)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_441b2bc324aa672a2741311af2068aa1 = L.marker(\n",
       "                [31.285831, 121.509813],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_d6582c33de049b52bbd7dbd28797888e = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_441b2bc324aa672a2741311af2068aa1.setIcon(icon_d6582c33de049b52bbd7dbd28797888e);\n",
       "        \n",
       "    \n",
       "        var popup_a59bb3718d3d4b32dfec3955f75d34b3 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_af56aa782e3c1cf04f44fbcc7a7822d8 = $(`&lt;div id=&quot;html_af56aa782e3c1cf04f44fbcc7a7822d8&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-7&lt;/div&gt;`)[0];\n",
       "                popup_a59bb3718d3d4b32dfec3955f75d34b3.setContent(html_af56aa782e3c1cf04f44fbcc7a7822d8);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_441b2bc324aa672a2741311af2068aa1.bindPopup(popup_a59bb3718d3d4b32dfec3955f75d34b3)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_46eec56e42b821ae0e49d3d2586f1844 = L.marker(\n",
       "                [31.286031, 121.509813],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_b79c488d6339e4ab59c9f5204150bc9e = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_46eec56e42b821ae0e49d3d2586f1844.setIcon(icon_b79c488d6339e4ab59c9f5204150bc9e);\n",
       "        \n",
       "    \n",
       "        var popup_44d771c83c22f0c51fe3d8fe4bde6ae6 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_40a1b5cfe03ced47417e9209068b3997 = $(`&lt;div id=&quot;html_40a1b5cfe03ced47417e9209068b3997&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-8&lt;/div&gt;`)[0];\n",
       "                popup_44d771c83c22f0c51fe3d8fe4bde6ae6.setContent(html_40a1b5cfe03ced47417e9209068b3997);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_46eec56e42b821ae0e49d3d2586f1844.bindPopup(popup_44d771c83c22f0c51fe3d8fe4bde6ae6)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_8fffe65938069c738323ff12a8797458 = L.marker(\n",
       "                [31.235231, 121.505123],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_a3f6139c41d8d413f8f8b535c1686859 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_8fffe65938069c738323ff12a8797458.setIcon(icon_a3f6139c41d8d413f8f8b535c1686859);\n",
       "        \n",
       "    \n",
       "        var popup_11a6d485d3ff2c581b516200c06b125b = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_949605499a3c3c82c3d47f0af3852cba = $(`&lt;div id=&quot;html_949605499a3c3c82c3d47f0af3852cba&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-9&lt;/div&gt;`)[0];\n",
       "                popup_11a6d485d3ff2c581b516200c06b125b.setContent(html_949605499a3c3c82c3d47f0af3852cba);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_8fffe65938069c738323ff12a8797458.bindPopup(popup_11a6d485d3ff2c581b516200c06b125b)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_2ec6045e7bd96efc106116c6386cd2e2 = L.marker(\n",
       "                [31.235431, 121.506163],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_b0928dc3ec51b3d4327432daecd8c078 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_2ec6045e7bd96efc106116c6386cd2e2.setIcon(icon_b0928dc3ec51b3d4327432daecd8c078);\n",
       "        \n",
       "    \n",
       "        var popup_c9cb51ab8aabd2bca1f9dc59a8fbac9e = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_345e7fc5b644f60e614cfb5ab3321014 = $(`&lt;div id=&quot;html_345e7fc5b644f60e614cfb5ab3321014&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-10&lt;/div&gt;`)[0];\n",
       "                popup_c9cb51ab8aabd2bca1f9dc59a8fbac9e.setContent(html_345e7fc5b644f60e614cfb5ab3321014);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_2ec6045e7bd96efc106116c6386cd2e2.bindPopup(popup_c9cb51ab8aabd2bca1f9dc59a8fbac9e)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_940a60c84ca05a07190687643dbc815f = L.marker(\n",
       "                [31.2974, 121.5036],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_ff8ae583143b03680ecef6837aaf7b49 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;home&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;blue&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_940a60c84ca05a07190687643dbc815f.setIcon(icon_ff8ae583143b03680ecef6837aaf7b49);\n",
       "        \n",
       "    \n",
       "        var popup_ce536da7fdc496ce6e56c2fd4aaee023 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_17308903e93afdff65d6625e8526bd8f = $(`&lt;div id=&quot;html_17308903e93afdff65d6625e8526bd8f&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;Fudan University&lt;/div&gt;`)[0];\n",
       "                popup_ce536da7fdc496ce6e56c2fd4aaee023.setContent(html_17308903e93afdff65d6625e8526bd8f);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_940a60c84ca05a07190687643dbc815f.bindPopup(popup_ce536da7fdc496ce6e56c2fd4aaee023)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_0efb1b7c04ba8aeeed2a1343999ae0f4 = L.marker(\n",
       "                [31.0252, 121.4338],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_09b0f1cda3214928fbe449f319407efc = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;home&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;blue&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_0efb1b7c04ba8aeeed2a1343999ae0f4.setIcon(icon_09b0f1cda3214928fbe449f319407efc);\n",
       "        \n",
       "    \n",
       "        var popup_2b4e1e7af404bc18025389a2faafbd4e = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_772f084264bf3ad475841a549c7a46c5 = $(`&lt;div id=&quot;html_772f084264bf3ad475841a549c7a46c5&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;Shanghai Jiao Tong University&lt;/div&gt;`)[0];\n",
       "                popup_2b4e1e7af404bc18025389a2faafbd4e.setContent(html_772f084264bf3ad475841a549c7a46c5);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_0efb1b7c04ba8aeeed2a1343999ae0f4.bindPopup(popup_2b4e1e7af404bc18025389a2faafbd4e)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_a80c24e7a4404304f72494e91394eab0 = L.marker(\n",
       "                [31.2261, 121.4376],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_f093224c5a474369b21978e4676440c1 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;home&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;blue&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_a80c24e7a4404304f72494e91394eab0.setIcon(icon_f093224c5a474369b21978e4676440c1);\n",
       "        \n",
       "    \n",
       "        var popup_35760b0b5bf146058295f4f587bec278 = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_5570757cc7da26bf44d66165b4b45cee = $(`&lt;div id=&quot;html_5570757cc7da26bf44d66165b4b45cee&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;East China Normal University&lt;/div&gt;`)[0];\n",
       "                popup_35760b0b5bf146058295f4f587bec278.setContent(html_5570757cc7da26bf44d66165b4b45cee);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_a80c24e7a4404304f72494e91394eab0.bindPopup(popup_35760b0b5bf146058295f4f587bec278)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_3189bb790fd9e3edc5c4affb5cae469e = L.marker(\n",
       "                [31.2859, 121.5098],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_4e516a5dbbd3b3b793381b889d510cc9 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;home&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;blue&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_3189bb790fd9e3edc5c4affb5cae469e.setIcon(icon_4e516a5dbbd3b3b793381b889d510cc9);\n",
       "        \n",
       "    \n",
       "        var popup_f50392bd7fc4caea0550017cab09b9cc = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_e9b7e165bb311777ee0cb5c42f87508c = $(`&lt;div id=&quot;html_e9b7e165bb311777ee0cb5c42f87508c&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;Tongji University&lt;/div&gt;`)[0];\n",
       "                popup_f50392bd7fc4caea0550017cab09b9cc.setContent(html_e9b7e165bb311777ee0cb5c42f87508c);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_3189bb790fd9e3edc5c4affb5cae469e.bindPopup(popup_f50392bd7fc4caea0550017cab09b9cc)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_192e91cf56293dd3752f0b4973addd4b = L.marker(\n",
       "                [31.2353, 121.5057],\n",
       "                {}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var icon_400244a7e5021bc1d724f81edb66b1bb = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;home&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;blue&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_192e91cf56293dd3752f0b4973addd4b.setIcon(icon_400244a7e5021bc1d724f81edb66b1bb);\n",
       "        \n",
       "    \n",
       "        var popup_bbad34504f853d59ef76f293e8d5642f = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_134559ff2ba1708a7db080916cb407f2 = $(`&lt;div id=&quot;html_134559ff2ba1708a7db080916cb407f2&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;Jinmao Building&lt;/div&gt;`)[0];\n",
       "                popup_bbad34504f853d59ef76f293e8d5642f.setContent(html_134559ff2ba1708a7db080916cb407f2);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_192e91cf56293dd3752f0b4973addd4b.bindPopup(popup_bbad34504f853d59ef76f293e8d5642f)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var poly_line_279b9eff13019b2ec52d037b3235cc55 = L.polyline(\n",
       "                [[31.298134, 121.503517], [31.2974, 121.5036]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_81cbd5c8d63950bab91644466136c8f7 = L.polyline(\n",
       "                [[31.297431, 121.503617], [31.2974, 121.5036]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_96271f4fdbad2f772d6f9b6d18259b29 = L.polyline(\n",
       "                [[31.025131, 121.433813], [31.0252, 121.4338]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_ae8eb9db40fb2bf1e297299f4f7bf5fc = L.polyline(\n",
       "                [[31.025331, 121.433813], [31.0252, 121.4338]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_ae02095337c6a4a5daee222fcdfe3b51 = L.polyline(\n",
       "                [[31.226031, 121.437613], [31.2261, 121.4376]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_ea4fe0f71d66325edfeeb87c21ad3627 = L.polyline(\n",
       "                [[31.226231, 121.437613], [31.2261, 121.4376]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_e3c4002296442d10fd9810614a46fe16 = L.polyline(\n",
       "                [[31.226231, 121.437613], [31.2261, 121.4376]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_e81bb177ea8b3c2b8c6760c1b02157d0 = L.polyline(\n",
       "                [[31.285831, 121.509813], [31.2859, 121.5098]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_136ba9ddbb91265f9dac367025692d71 = L.polyline(\n",
       "                [[31.286031, 121.509813], [31.2859, 121.5098]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_e7d214b9e9c6c65ea2d30fd6a46e3491 = L.polyline(\n",
       "                [[31.235231, 121.505123], [31.2353, 121.5057]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "    \n",
       "            var poly_line_0ff5aaa45e1d340c4c09f82c452bfe04 = L.polyline(\n",
       "                [[31.235431, 121.506163], [31.2353, 121.5057]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_db0afcb081ddd8571f4d3232f8e9a225);\n",
       "        \n",
       "&lt;/script&gt;\n",
       "&lt;/html&gt;\" style=\"position:absolute;width:100%;height:100%;left:0;top:0;border:none !important;\" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe></div></div>"
      ],
      "text/plain": [
       "<folium.folium.Map at 0x7f919c22c550>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import folium\n",
    "import math\n",
    "\n",
    "# INSERT VERTEX place (geo_point, name, city) VALUES\n",
    "#     \"place-0\":(ST_GeogFromText(\"POINT (121.5036 31.2974)\"), \"Fudan University\", \"Shanghai\"),\n",
    "#     \"place-1\":(ST_GeogFromText(\"POINT (121.4338 31.0252)\"), \"Shanghai Jiao Tong University\", \"Shanghai\"),\n",
    "#     \"place-2\":(ST_GeogFromText(\"POINT (121.4376 31.2261)\"), \"East China Normal University\", \"Shanghai\"),\n",
    "#     \"place-3\":(ST_GeogFromText(\"POINT (121.5098 31.2859)\"), \"Tongji University\", \"Shanghai\"),\n",
    "#     \"place-4\":(ST_GeogFromText(\"POINT (121.5057 31.2353)\"), \"Jinmao Building\", \"Shanghai\");\n",
    "\n",
    "# INSERT VERTEX place (geo_point, name, city) VALUES\n",
    "#     \"place-10\":(ST_GeogFromText(\"POINT (121.503517 31.298134)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-11\":(ST_GeogFromText(\"POINT (121.503617 31.297431)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-12\":(ST_GeogFromText(\"POINT (121.433813 31.025131)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-13\":(ST_GeogFromText(\"POINT (121.433813 31.025331)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-14\":(ST_GeogFromText(\"POINT (121.437613 31.226031)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-15\":(ST_GeogFromText(\"POINT (121.437613 31.226231)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-16\":(ST_GeogFromText(\"POINT (121.509813 31.285831)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-17\":(ST_GeogFromText(\"POINT (121.509813 31.286031)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-18\":(ST_GeogFromText(\"POINT (121.505123 31.235231)\"), \"\", \"Shanghai\"),\n",
    "#     \"place-19\":(ST_GeogFromText(\"POINT (121.506163 31.235431)\"), \"\", \"Shanghai\");\n",
    "\n",
    "points_subscriber = [\n",
    "\n",
    "    (31.298134, 121.503517, \"sub-0\"),\n",
    "    (31.297431, 121.503617, \"sub-1\"),\n",
    "    (31.025131, 121.433813, \"sub-2\"),\n",
    "    (31.025331, 121.433813, \"sub-3\"),\n",
    "    (31.226031, 121.437613, \"sub-4\"),\n",
    "    (31.226231, 121.437613, \"sub-5\"),\n",
    "    (31.226231, 121.437613, \"sub-6\"),\n",
    "    (31.285831, 121.509813, \"sub-7\"),\n",
    "    (31.286031, 121.509813, \"sub-8\"),\n",
    "    (31.235231, 121.505123, \"sub-9\"),\n",
    "    (31.235431, 121.506163, \"sub-10\"),\n",
    "]\n",
    "\n",
    "points_place = [\n",
    "    # Fudan University\n",
    "    (31.2974, 121.5036, \"Fudan University\"),\n",
    "    # Shanghai Jiao Tong University\n",
    "    (31.0252, 121.4338, \"Shanghai Jiao Tong University\"),\n",
    "    # East China Normal University\n",
    "    (31.2261, 121.4376, \"East China Normal University\"),\n",
    "    # Tongji University\n",
    "    (31.2859, 121.5098, \"Tongji University\"),\n",
    "    # JinMao Building\n",
    "    (31.2353, 121.5057, \"Jinmao Building\"),\n",
    "]\n",
    "\n",
    "# JinMao Building\n",
    "shagnhai_cbd = [31.2353, 121.5057]\n",
    "\n",
    "\n",
    "\n",
    "# draw circle of points_place places in folium map\n",
    "def draw_circle(map_graph, points_place, radius):\n",
    "    for point in points_place:\n",
    "        folium.Circle(location=point[:2], radius=int(radius*1000), color='blue', fill=True, fill_color='#3186cc').add_to(map_graph)\n",
    "\n",
    "# draw points of points_subscriber in folium map\n",
    "def draw_points(map_graph, points_subscriber, color='green', icon='user'):\n",
    "    for point in points_subscriber:\n",
    "        # plot the points with icon of user\n",
    "        lat, lon = point[0], point[1]\n",
    "        vertex_id = point[2]\n",
    "        folium.Marker(location=[lat, lon], popup=vertex_id, icon=folium.Icon(\n",
    "            color=color,\n",
    "            icon=icon,\n",
    "        )).add_to(map_graph)\n",
    "\n",
    "# draw connections between points_subscriber and points_place if the distance is less than radius\n",
    "def draw_connections(map_graph, points_subscriber, points_place):\n",
    "    for point_subscriber in points_subscriber:\n",
    "        for point_place in points_place:\n",
    "            lat_subscriber, lon_subscriber = point_subscriber[0], point_subscriber[1]\n",
    "            lat_place, lon_place = point_place[0], point_place[1]\n",
    "            distance = math.sqrt((lat_subscriber-lat_place)**2 + (lon_subscriber-lon_place)**2)\n",
    "            if distance < 0.001:\n",
    "                folium.PolyLine(locations=[point_subscriber[:2], point_place[:2]], color='red').add_to(map_graph)\n",
    "\n",
    "# Create a folium map centered at CBD\n",
    "map_graph = folium.Map(location=shagnhai_cbd, zoom_start=13)\n",
    "\n",
    "draw_circle(map_graph, points_place, 1)\n",
    "draw_points(map_graph, points_subscriber)\n",
    "draw_points(map_graph, points_place, color='blue', icon='home')\n",
    "draw_connections(map_graph, points_subscriber, points_place)\n",
    "\n",
    "# Save the map to an HTML file\n",
    "#map_graph.save(\"nodes_with_circles.html\")\n",
    "\n",
    "from IPython.display import display\n",
    "display(map_graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "b2061135-4950-4423-a28c-84afc323cccc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>birth</th>\n",
       "      <th>profile</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-0</td>\n",
       "      <td>Tom Smith</td>\n",
       "      <td>1998-03-17</td>\n",
       "      <td>Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sub-1</td>\n",
       "      <td>Emma Smith</td>\n",
       "      <td>1998-11-15</td>\n",
       "      <td>Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sub-10</td>\n",
       "      <td>Mia Garcia</td>\n",
       "      <td>1995-08-25</td>\n",
       "      <td>Student</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       id        name       birth  profile\n",
       "0   sub-0   Tom Smith  1998-03-17  Student\n",
       "1   sub-1  Emma Smith  1998-11-15  Student\n",
       "2  sub-10  Mia Garcia  1995-08-25  Student"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH (sub:subscriber)-[:stays_in]->(place:place)\n",
    "WHERE (\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5036 31.2974)\")\n",
    "                ) < 1000\n",
    "                OR\n",
    "    place.place.name == \"Fudan University\")\n",
    "        AND\n",
    "    sub.subscriber.birth > date(\"1994-12-31\")\n",
    "RETURN id(sub) AS id, sub.subscriber.name AS name, sub.subscriber.birth AS birth,\n",
    "    \"Student\" AS profile"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "b450ea68",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"sub-0\" :subscriber{msisdn: 13900000001, name...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"sub-1\" :subscriber{msisdn: 13900000002, name...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   p\n",
       "0  (\"sub-0\" :subscriber{msisdn: 13900000001, name...\n",
       "1  (\"sub-1\" :subscriber{msisdn: 13900000002, name..."
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH p=(sub:subscriber)-[:stays_in]->(place:place)\n",
    "WHERE (\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5036 31.2974)\")\n",
    "                ) < 1000\n",
    "                OR\n",
    "    place.place.name == \"Fudan University\")\n",
    "        AND\n",
    "    sub.subscriber.birth > date(\"1996-12-31\")\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "fe27939e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f90c5ce4fa0>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "90cfbd9b-51de-4644-a36d-e2f1274ca594",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_2.2.html"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d8850fe2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "# 增加边：Student 画像\n",
    "\n",
    "INSERT EDGE was (`time`) VALUES\n",
    "    \"sub-0\"->\"profile-0\":(datetime(\"2023-06-01 12:00:00\")),\n",
    "    \"sub-1\"->\"profile-0\":(datetime(\"2023-06-11 13:01:30\")),\n",
    "    \"sub-2\"->\"profile-0\":(datetime(\"2023-06-21 14:03:00\")),\n",
    "    \"sub-3\"->\"profile-0\":(datetime(\"2023-06-02 15:04:30\")),\n",
    "    \"sub-4\"->\"profile-0\":(datetime(\"2023-06-12 16:06:00\")),\n",
    "    \"sub-5\"->\"profile-0\":(datetime(\"2023-06-22 17:07:30\")),\n",
    "    \"sub-6\"->\"profile-0\":(datetime(\"2023-06-03 18:09:00\")),\n",
    "    \"sub-7\"->\"profile-0\":(datetime(\"2023-06-13 19:10:30\")),\n",
    "    \"sub-8\"->\"profile-0\":(datetime(\"2023-06-23 20:12:00\")),\n",
    "    \"sub-9\"->\"profile-0\":(datetime(\"2023-06-04 21:13:30\")),\n",
    "    \"sub-10\"->\"profile-0\":(datetime(\"2022-06-14 22:15:00\"));\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "7f81af9a-3889-4bc6-a25a-26cc8ba303ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    p\n",
       "0   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "1   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "2   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "3   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "4   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "5   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "6   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "7   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "8   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "9   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "10  (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "11  (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "12  (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "13  (\"profile-0\" :profile{name: \"Student\"})<-[:was..."
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH p=(:`profile`{name:\"Student\"})<-[:was]-(sub:subscriber)-[:stays_in]->(place:place)\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "38d073d3-25a0-446f-851c-8c86e3c638ba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f9184be8280>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "320a403d-150a-4455-acba-5b2dcdd3e5bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_2.2_b.html"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5c38aeca",
   "metadata": {},
   "source": [
    "#### 2.3 图上增加画像：在复旦大学、上海交通大学的学生是 C9高校画像\n",
    "\n",
    "Query based on **GEO distance**\n",
    "\n",
    "```cypher\n",
    "MATCH (place:place)<-[:stays_in]-(sub:subscriber)-[:was]->(:`profile`{name:\"Student\"})\n",
    "WHERE (\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5036 31.2974)\")\n",
    "                ) < 1000\n",
    "                OR\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.4338 31.0252)\")\n",
    "                ) < 1000\n",
    "                OR\n",
    "    place.place.name IN [\"Fudan University\", \"Shanghai Jiao Tong University\"])\n",
    "        AND\n",
    "    sub.subscriber.birth > date(\"1996-12-31\")\n",
    "RETURN id(sub) AS id, sub.subscriber.name AS name, sub.subscriber.birth AS birth,\n",
    "    \"C9\" AS profile\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "044f02b1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>birth</th>\n",
       "      <th>profile</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-0</td>\n",
       "      <td>Tom Smith</td>\n",
       "      <td>1998-03-17</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sub-1</td>\n",
       "      <td>Emma Smith</td>\n",
       "      <td>1998-11-15</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sub-2</td>\n",
       "      <td>Liam Johnson</td>\n",
       "      <td>2001-07-03</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>sub-3</td>\n",
       "      <td>Olivia Brown</td>\n",
       "      <td>1999-12-28</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      id          name       birth      profile\n",
       "0  sub-0     Tom Smith  1998-03-17  C9, Student\n",
       "1  sub-1    Emma Smith  1998-11-15  C9, Student\n",
       "2  sub-2  Liam Johnson  2001-07-03  C9, Student\n",
       "3  sub-3  Olivia Brown  1999-12-28  C9, Student"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH (place:place)<-[:stays_in]-(sub:subscriber)-[:was]->(:`profile`{name:\"Student\"})\n",
    "WHERE (\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5036 31.2974)\")\n",
    "                ) < 1000\n",
    "                OR\n",
    "    ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.4338 31.0252)\")\n",
    "                ) < 1000\n",
    "                OR\n",
    "    place.place.name IN [\"Fudan University\", \"Shanghai Jiao Tong University\"])\n",
    "        AND\n",
    "    sub.subscriber.birth > date(\"1996-12-31\")\n",
    "RETURN id(sub) AS id, sub.subscriber.name AS name, sub.subscriber.birth AS birth,\n",
    "    \"C9\" + \", \" + \"Student\" AS profile"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c063b783",
   "metadata": {},
   "source": [
    "#### 2.3.1 加边：常驻地址的区域归属\n",
    "\n",
    "Or, we could add in_region_of relationship between place and region, and query based on region."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "fc4fd10c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "# 增加边：标记地位位置在区域内\n",
    "\n",
    "INSERT EDGE in_region_of () VALUES\n",
    "    \"place-10\"->\"place-0\":(),\n",
    "    \"place-11\"->\"place-0\":(),\n",
    "    \"place-12\"->\"place-1\":(),\n",
    "    \"place-13\"->\"place-1\":(),\n",
    "    \"place-14\"->\"place-2\":(),\n",
    "    \"place-15\"->\"place-2\":(),\n",
    "    \"place-15\"->\"place-3\":(),\n",
    "    \"place-16\"->\"place-3\":(),\n",
    "    \"place-17\"->\"place-4\":(),\n",
    "    \"place-18\"->\"place-4\":(),\n",
    "    \"place-19\"->\"place-4\":();\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e47ad53c-9692-4f51-9ef6-61182e1e552f",
   "metadata": {},
   "source": [
    "通过这个新加的边可以获得更多解释性\n",
    "\n",
    "Then we could query with `in_region_of` relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "ce9e2c24",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>birth</th>\n",
       "      <th>profile</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-10</td>\n",
       "      <td>Mia Garcia</td>\n",
       "      <td>1995-08-25</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sub-0</td>\n",
       "      <td>Tom Smith</td>\n",
       "      <td>1998-03-17</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sub-1</td>\n",
       "      <td>Emma Smith</td>\n",
       "      <td>1998-11-15</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>sub-3</td>\n",
       "      <td>Olivia Brown</td>\n",
       "      <td>1999-12-28</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>sub-2</td>\n",
       "      <td>Liam Johnson</td>\n",
       "      <td>2001-07-03</td>\n",
       "      <td>C9, Student</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       id          name       birth      profile\n",
       "0  sub-10    Mia Garcia  1995-08-25  C9, Student\n",
       "1   sub-0     Tom Smith  1998-03-17  C9, Student\n",
       "2   sub-1    Emma Smith  1998-11-15  C9, Student\n",
       "3   sub-3  Olivia Brown  1999-12-28  C9, Student\n",
       "4   sub-2  Liam Johnson  2001-07-03  C9, Student"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH (region:place)<-[:in_region_of]-(:place)<-[:stays_in]-(sub:subscriber)-[:was]->(:`profile`{name:\"Student\"})\n",
    "WHERE region.place.name IN [\"Fudan University\", \"Shanghai Jiao Tong University\"]\n",
    "        AND\n",
    "    sub.subscriber.birth > date(\"1994-12-31\")\n",
    "RETURN id(sub) AS id, sub.subscriber.name AS name, sub.subscriber.birth AS birth,\n",
    "    \"C9\" + \", \" + \"Student\" AS profile"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b496ce81-4c30-4395-9131-d5e988135acf",
   "metadata": {},
   "source": [
    "#### 2.3.2 增加 C9 画像"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "33086505",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "# 增加边：C9 画像\n",
    "\n",
    "INSERT EDGE was (`time`) VALUES\n",
    "    \"sub-0\"->\"profile-1\":(datetime(\"2023-06-11 12:00:00\")),\n",
    "    \"sub-1\"->\"profile-1\":(datetime(\"2023-06-21 13:01:30\")),\n",
    "    \"sub-2\"->\"profile-1\":(datetime(\"2023-06-30 14:03:00\")),\n",
    "    \"sub-3\"->\"profile-1\":(datetime(\"2023-06-12 15:04:30\")),\n",
    "    \"sub-10\"->\"profile-1\":(datetime(\"2022-06-12 11:04:30\"));"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "349440ce-5c28-400e-82dc-28096412ce8a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"place-0\" :place{name: \"Fudan University\", ci...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"place-4\" :place{name: \"Jinmao Building\", cit...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>(\"place-0\" :place{name: \"Fudan University\", ci...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>(\"place-0\" :place{name: \"Fudan University\", ci...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>(\"place-1\" :place{name: \"Shanghai Jiao Tong Un...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>(\"place-1\" :place{name: \"Shanghai Jiao Tong Un...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   p\n",
       "0  (\"place-0\" :place{name: \"Fudan University\", ci...\n",
       "1  (\"place-4\" :place{name: \"Jinmao Building\", cit...\n",
       "2  (\"place-0\" :place{name: \"Fudan University\", ci...\n",
       "3  (\"place-0\" :place{name: \"Fudan University\", ci...\n",
       "4  (\"place-1\" :place{name: \"Shanghai Jiao Tong Un...\n",
       "5  (\"place-1\" :place{name: \"Shanghai Jiao Tong Un..."
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH p=(region:place)<-[:in_region_of]-(:place)<-[:stays_in]-(sub:subscriber)-[:was]->(:`profile`{name:\"C9\"})\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b8cc691f-3e77-4096-a92d-52df274ca375",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f9184bf9310>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "b0799347-a0de-429e-9a86-311f5f55089b",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_2.3.2.html"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ed7828d",
   "metadata": {},
   "source": [
    "#### 2.4 画像：使用高性价比手机的学生，则是\"学生智能\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "7c4c3eb8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID</th>\n",
       "      <th>Name</th>\n",
       "      <th>profile</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-0</td>\n",
       "      <td>Tom Smith</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sub-1</td>\n",
       "      <td>Emma Smith</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sub-10</td>\n",
       "      <td>Mia Garcia</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>sub-2</td>\n",
       "      <td>Liam Johnson</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>sub-5</td>\n",
       "      <td>Ava Wilson</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>sub-6</td>\n",
       "      <td>Sophia Taylor</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>sub-7</td>\n",
       "      <td>Jackson Anderson</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>sub-8</td>\n",
       "      <td>Isabella Martinez</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>sub-9</td>\n",
       "      <td>Aiden Thompson</td>\n",
       "      <td>Student Smart Phone</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       ID               Name              profile\n",
       "0   sub-0          Tom Smith  Student Smart Phone\n",
       "1   sub-1         Emma Smith  Student Smart Phone\n",
       "2  sub-10         Mia Garcia  Student Smart Phone\n",
       "3   sub-2       Liam Johnson  Student Smart Phone\n",
       "4   sub-5         Ava Wilson  Student Smart Phone\n",
       "5   sub-6      Sophia Taylor  Student Smart Phone\n",
       "6   sub-7   Jackson Anderson  Student Smart Phone\n",
       "7   sub-8  Isabella Martinez  Student Smart Phone\n",
       "8   sub-9     Aiden Thompson  Student Smart Phone"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH (:profile{name: \"Student\"})<-[was_student:was]-(sub:subscriber)-[:owned_device]->(:device)-[:with_model]->(:device_model)-[:is_categorized_as]->(:product_category{name: \"Cost-effective Product\"})\n",
    "    WHERE was_student.`time` > datetime(\"2022-05-31 12:00:00\")\n",
    "RETURN id(sub) AS ID, sub.subscriber.name AS Name,\n",
    "    \"Student Smart Phone\" AS Profile ORDER BY ID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "c8f28f47",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "# 增加边：\"学生智能\" 画像\n",
    "\n",
    "INSERT EDGE was (`time`) VALUES\n",
    "    \"sub-0\"->\"profile-2\":(datetime(\"2023-06-11 12:00:00\")),\n",
    "    \"sub-1\"->\"profile-2\":(datetime(\"2023-06-21 13:01:30\")),\n",
    "    \"sub-10\"->\"profile-2\":(datetime(\"2022-06-12 15:04:30\")),\n",
    "    \"sub-2\"->\"profile-2\":(datetime(\"2023-06-30 14:03:00\")),\n",
    "    \"sub-5\"->\"profile-2\":(datetime(\"2023-06-02 17:07:30\")),\n",
    "    \"sub-6\"->\"profile-2\":(datetime(\"2023-06-12 18:09:00\")),\n",
    "    \"sub-7\"->\"profile-2\":(datetime(\"2023-06-22 19:10:30\")),\n",
    "    \"sub-8\"->\"profile-2\":(datetime(\"2023-06-02 20:12:00\")),\n",
    "    \"sub-9\"->\"profile-2\":(datetime(\"2023-06-12 21:13:30\"));"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "332c607e-9458-4e35-8fba-9001978748f4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   p\n",
       "0  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "1  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "2  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "3  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "4  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "5  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "6  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "7  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "8  (\"profile-2\" :profile{name: \"Student Smart Pho..."
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH p=(:profile{name: \"Student Smart Phone\"})<-[:was]-(sub:subscriber)-[:owned_device]->(:device)-[:with_model]->(:device_model)-[:is_categorized_as]->(:product_category{name: \"Cost-effective Product\"})\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "8850f083-1a66-4544-b801-47c1f03483f0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f9184b74a00>"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d78c3f6c",
   "metadata": {},
   "source": [
    "#### 2.5 同时拥有”学生智能“与”C9高校”画像，那么他们是潜在高消费用户画像"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "989d279b-805f-4b08-8d76-bd4492cf41dd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID</th>\n",
       "      <th>Name</th>\n",
       "      <th>profile</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-0</td>\n",
       "      <td>Tom Smith</td>\n",
       "      <td>Potential High-end Consumer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>sub-1</td>\n",
       "      <td>Emma Smith</td>\n",
       "      <td>Potential High-end Consumer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>sub-10</td>\n",
       "      <td>Mia Garcia</td>\n",
       "      <td>Potential High-end Consumer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>sub-2</td>\n",
       "      <td>Liam Johnson</td>\n",
       "      <td>Potential High-end Consumer</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       ID          Name                      profile\n",
       "0   sub-0     Tom Smith  Potential High-end Consumer\n",
       "1   sub-1    Emma Smith  Potential High-end Consumer\n",
       "2  sub-10    Mia Garcia  Potential High-end Consumer\n",
       "3   sub-2  Liam Johnson  Potential High-end Consumer"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH (:profile{name: \"Student Smart Phone\"})<-[was:was]-(sub:subscriber)-[:was]->(:profile{name: \"C9\"})\n",
    "RETURN id(sub) AS ID, sub.subscriber.name AS Name,\n",
    "    \"Potential High-end Consumer\" AS Profile ORDER BY ID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "a0d51fd7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "# 增加边：潜在高端消费者 画像\n",
    "\n",
    "INSERT EDGE was (`time`) VALUES\n",
    "    \"sub-10\"->\"profile-3\":(datetime(\"2023-06-11 12:00:00\")),\n",
    "    \"sub-1\"->\"profile-3\":(datetime(\"2023-06-21 13:01:30\")),\n",
    "    \"sub-2\"->\"profile-3\":(datetime(\"2023-06-30 14:03:00\")),\n",
    "    \"sub-3\"->\"profile-3\":(datetime(\"2023-06-12 15:04:30\"));"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "0a7c4aad-8b11-4cd7-b63f-00ce13221414",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"profile-1\" :profile{name: \"C9\"})&lt;-[:was@0{ti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>(\"profile-1\" :profile{name: \"C9\"})&lt;-[:was@0{ti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>(\"profile-1\" :profile{name: \"C9\"})&lt;-[:was@0{ti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>(\"profile-0\" :profile{name: \"Student\"})&lt;-[:was...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>(\"profile-1\" :profile{name: \"C9\"})&lt;-[:was@0{ti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    p\n",
       "0   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "1   (\"profile-1\" :profile{name: \"C9\"})<-[:was@0{ti...\n",
       "2   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "3   (\"profile-1\" :profile{name: \"C9\"})<-[:was@0{ti...\n",
       "4   (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "5   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "6   (\"profile-1\" :profile{name: \"C9\"})<-[:was@0{ti...\n",
       "7   (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "8   (\"profile-0\" :profile{name: \"Student\"})<-[:was...\n",
       "9   (\"profile-1\" :profile{name: \"C9\"})<-[:was@0{ti...\n",
       "10  (\"profile-2\" :profile{name: \"Student Smart Pho..."
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "# 图解释\n",
    "\n",
    "MATCH p=(:profile)<-[:was]-(:subscriber)-[:was]->(profile:profile)\n",
    "   WHERE profile.profile.name IN [\"Potential High-end Consumer\"]\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "c3b41821-7255-4aa7-991a-6a4feb70a31d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f9184bd27c0>"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "5bc820b2-e480-428b-a97a-d3297d5fa4c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_2.5.html"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5cc9cf9e-36a2-4112-9b9e-df356c67af30",
   "metadata": {},
   "source": [
    "### 3. 图谱应用"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d3f3602f",
   "metadata": {},
   "source": [
    "### 3.1 毕业季学生智能画像的用户，推荐合约机"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "14cba464-5cc1-4236-8dbb-229630b5f583",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>MSISDN</th>\n",
       "      <th>current_phone</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>13900000008</td>\n",
       "      <td>RedMi 8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>13900000007</td>\n",
       "      <td>RedMi 7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>13900000006</td>\n",
       "      <td>RedMi 6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>13900000010</td>\n",
       "      <td>iPhone 6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>13900000003</td>\n",
       "      <td>iPhone 8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>13900000009</td>\n",
       "      <td>RedMi 9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>13900000011</td>\n",
       "      <td>iPhone 7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>13900000002</td>\n",
       "      <td>iPhone 7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>13900000001</td>\n",
       "      <td>iPhone 6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        MSISDN current_phone\n",
       "0  13900000008       RedMi 8\n",
       "1  13900000007       RedMi 7\n",
       "2  13900000006       RedMi 6\n",
       "3  13900000010      iPhone 6\n",
       "4  13900000003      iPhone 8\n",
       "5  13900000009       RedMi 9\n",
       "6  13900000011      iPhone 7\n",
       "7  13900000002      iPhone 7\n",
       "8  13900000001      iPhone 6"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "MATCH p=(:profile{name: \"Student Smart Phone\"})<-[:was]-(sub:subscriber)-[:owned_device]->(phone:device)\n",
    "RETURN sub.subscriber.msisdn AS MSISDN, phone.device.model AS current_phone"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "9d26568b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   p\n",
       "0  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "1  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "2  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "3  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "4  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "5  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "6  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "7  (\"profile-2\" :profile{name: \"Student Smart Pho...\n",
       "8  (\"profile-2\" :profile{name: \"Student Smart Pho..."
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "# Graph Explanation\n",
    "\n",
    "MATCH p=(:profile{name: \"Student Smart Phone\"})<-[:was]-(sub:subscriber)-[:owned_device]->(:device)-[:with_model]->(:device_model)-[:is_categorized_as]->(:product_category{name: \"Cost-effective Product\"})\n",
    "RETURN p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "f3a1ae46-fd01-47f8-a0d2-6f67bda36c3a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f9184b56a30>"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "03362f46-943c-4e8a-b367-e02943023db5",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_3.1.html"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fdd57d24-d996-42ec-80a4-de984db7bf12",
   "metadata": {},
   "source": [
    "### 3.2 曾经 C9 现在在 CDB 的高消费潜在用户适合被推荐高级服务\n",
    "\n",
    "举例来说，一个 CBD 中的用户如下"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "07244211-16a3-47d3-853c-27566f7bd157",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div style=\"width:100%;\"><div style=\"position:relative;width:100%;height:0;padding-bottom:60%;\"><span style=\"color:#565656\">Make this Notebook Trusted to load map: File -> Trust Notebook</span><iframe srcdoc=\"&lt;!DOCTYPE html&gt;\n",
       "&lt;html&gt;\n",
       "&lt;head&gt;\n",
       "    \n",
       "    &lt;meta http-equiv=&quot;content-type&quot; content=&quot;text/html; charset=UTF-8&quot; /&gt;\n",
       "    \n",
       "        &lt;script&gt;\n",
       "            L_NO_TOUCH = false;\n",
       "            L_DISABLE_3D = false;\n",
       "        &lt;/script&gt;\n",
       "    \n",
       "    &lt;style&gt;html, body {width: 100%;height: 100%;margin: 0;padding: 0;}&lt;/style&gt;\n",
       "    &lt;style&gt;#map {position:absolute;top:0;bottom:0;right:0;left:0;}&lt;/style&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://code.jquery.com/jquery-1.12.4.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/js/bootstrap.bundle.min.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;script src=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.js&quot;&gt;&lt;/script&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/leaflet@1.9.3/dist/leaflet.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/bootstrap@5.2.2/dist/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/npm/@fortawesome/fontawesome-free@6.2.0/css/all.min.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdnjs.cloudflare.com/ajax/libs/Leaflet.awesome-markers/2.0.2/leaflet.awesome-markers.css&quot;/&gt;\n",
       "    &lt;link rel=&quot;stylesheet&quot; href=&quot;https://cdn.jsdelivr.net/gh/python-visualization/folium/folium/templates/leaflet.awesome.rotate.min.css&quot;/&gt;\n",
       "    \n",
       "            &lt;meta name=&quot;viewport&quot; content=&quot;width=device-width,\n",
       "                initial-scale=1.0, maximum-scale=1.0, user-scalable=no&quot; /&gt;\n",
       "            &lt;style&gt;\n",
       "                #map_035481fa9865495be3f857a22082e294 {\n",
       "                    position: relative;\n",
       "                    width: 100.0%;\n",
       "                    height: 100.0%;\n",
       "                    left: 0.0%;\n",
       "                    top: 0.0%;\n",
       "                }\n",
       "                .leaflet-container { font-size: 1rem; }\n",
       "            &lt;/style&gt;\n",
       "        \n",
       "&lt;/head&gt;\n",
       "&lt;body&gt;\n",
       "    \n",
       "    \n",
       "            &lt;div class=&quot;folium-map&quot; id=&quot;map_035481fa9865495be3f857a22082e294&quot; &gt;&lt;/div&gt;\n",
       "        \n",
       "&lt;/body&gt;\n",
       "&lt;script&gt;\n",
       "    \n",
       "    \n",
       "            var map_035481fa9865495be3f857a22082e294 = L.map(\n",
       "                &quot;map_035481fa9865495be3f857a22082e294&quot;,\n",
       "                {\n",
       "                    center: [31.2353, 121.5057],\n",
       "                    crs: L.CRS.EPSG3857,\n",
       "                    zoom: 20,\n",
       "                    zoomControl: true,\n",
       "                    preferCanvas: false,\n",
       "                }\n",
       "            );\n",
       "\n",
       "            \n",
       "\n",
       "        \n",
       "    \n",
       "            var tile_layer_9b74eab1a57c2177c659a1ab29a5f288 = L.tileLayer(\n",
       "                &quot;https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png&quot;,\n",
       "                {&quot;attribution&quot;: &quot;Data by \\u0026copy; \\u003ca target=\\&quot;_blank\\&quot; href=\\&quot;http://openstreetmap.org\\&quot;\\u003eOpenStreetMap\\u003c/a\\u003e, under \\u003ca target=\\&quot;_blank\\&quot; href=\\&quot;http://www.openstreetmap.org/copyright\\&quot;\\u003eODbL\\u003c/a\\u003e.&quot;, &quot;detectRetina&quot;: false, &quot;maxNativeZoom&quot;: 18, &quot;maxZoom&quot;: 18, &quot;minZoom&quot;: 0, &quot;noWrap&quot;: false, &quot;opacity&quot;: 1, &quot;subdomains&quot;: &quot;abc&quot;, &quot;tms&quot;: false}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "    \n",
       "            var circle_4096426bc05cd95b0de5642859848923 = L.circle(\n",
       "                [31.2353, 121.5057],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;blue&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: true, &quot;fillColor&quot;: &quot;#3186cc&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;opacity&quot;: 1.0, &quot;radius&quot;: 100, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "    \n",
       "            var marker_ced3f451a36118d2ea07d8785ab68cce = L.marker(\n",
       "                [31.235231, 121.505123],\n",
       "                {}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "    \n",
       "            var icon_4edeb39c6640e866c567de8350fee2d0 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_ced3f451a36118d2ea07d8785ab68cce.setIcon(icon_4edeb39c6640e866c567de8350fee2d0);\n",
       "        \n",
       "    \n",
       "        var popup_af87e981f971959c8e24e364df2edc4d = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_79228f1fe320aee97df7525f3049b8da = $(`&lt;div id=&quot;html_79228f1fe320aee97df7525f3049b8da&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-9&lt;/div&gt;`)[0];\n",
       "                popup_af87e981f971959c8e24e364df2edc4d.setContent(html_79228f1fe320aee97df7525f3049b8da);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_ced3f451a36118d2ea07d8785ab68cce.bindPopup(popup_af87e981f971959c8e24e364df2edc4d)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_dde92d5a805f826c7e9f0a83f9b26580 = L.marker(\n",
       "                [31.235431, 121.506163],\n",
       "                {}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "    \n",
       "            var icon_5ed76fc1ac0284c10ec741bbb9d30c2a = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;user&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;green&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_dde92d5a805f826c7e9f0a83f9b26580.setIcon(icon_5ed76fc1ac0284c10ec741bbb9d30c2a);\n",
       "        \n",
       "    \n",
       "        var popup_f5f13cc37e02d2d6826e40ea2359bfff = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_f4f98cd1b0199ce14a9a6e79835261e5 = $(`&lt;div id=&quot;html_f4f98cd1b0199ce14a9a6e79835261e5&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;sub-10&lt;/div&gt;`)[0];\n",
       "                popup_f5f13cc37e02d2d6826e40ea2359bfff.setContent(html_f4f98cd1b0199ce14a9a6e79835261e5);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_dde92d5a805f826c7e9f0a83f9b26580.bindPopup(popup_f5f13cc37e02d2d6826e40ea2359bfff)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var marker_64fb8f29177a3dc42835aea535b51dd0 = L.marker(\n",
       "                [31.2353, 121.5057],\n",
       "                {}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "    \n",
       "            var icon_14d50ba0f51cbdce9d9376d373a16f24 = L.AwesomeMarkers.icon(\n",
       "                {&quot;extraClasses&quot;: &quot;fa-rotate-0&quot;, &quot;icon&quot;: &quot;home&quot;, &quot;iconColor&quot;: &quot;white&quot;, &quot;markerColor&quot;: &quot;blue&quot;, &quot;prefix&quot;: &quot;glyphicon&quot;}\n",
       "            );\n",
       "            marker_64fb8f29177a3dc42835aea535b51dd0.setIcon(icon_14d50ba0f51cbdce9d9376d373a16f24);\n",
       "        \n",
       "    \n",
       "        var popup_1c1b76bea8e4f8e171d19c6583ca055f = L.popup({&quot;maxWidth&quot;: &quot;100%&quot;});\n",
       "\n",
       "        \n",
       "            \n",
       "                var html_c533048f764438abb50d00b96fdcbf0e = $(`&lt;div id=&quot;html_c533048f764438abb50d00b96fdcbf0e&quot; style=&quot;width: 100.0%; height: 100.0%;&quot;&gt;Jinmao Building&lt;/div&gt;`)[0];\n",
       "                popup_1c1b76bea8e4f8e171d19c6583ca055f.setContent(html_c533048f764438abb50d00b96fdcbf0e);\n",
       "            \n",
       "        \n",
       "\n",
       "        marker_64fb8f29177a3dc42835aea535b51dd0.bindPopup(popup_1c1b76bea8e4f8e171d19c6583ca055f)\n",
       "        ;\n",
       "\n",
       "        \n",
       "    \n",
       "    \n",
       "            var poly_line_a39034c3dbaa2357f6aec61313505e52 = L.polyline(\n",
       "                [[31.235231, 121.505123], [31.2353, 121.5057]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "    \n",
       "            var poly_line_48492b7a97726bf0595fbada77a620f4 = L.polyline(\n",
       "                [[31.235431, 121.506163], [31.2353, 121.5057]],\n",
       "                {&quot;bubblingMouseEvents&quot;: true, &quot;color&quot;: &quot;red&quot;, &quot;dashArray&quot;: null, &quot;dashOffset&quot;: null, &quot;fill&quot;: false, &quot;fillColor&quot;: &quot;red&quot;, &quot;fillOpacity&quot;: 0.2, &quot;fillRule&quot;: &quot;evenodd&quot;, &quot;lineCap&quot;: &quot;round&quot;, &quot;lineJoin&quot;: &quot;round&quot;, &quot;noClip&quot;: false, &quot;opacity&quot;: 1.0, &quot;smoothFactor&quot;: 1.0, &quot;stroke&quot;: true, &quot;weight&quot;: 3}\n",
       "            ).addTo(map_035481fa9865495be3f857a22082e294);\n",
       "        \n",
       "&lt;/script&gt;\n",
       "&lt;/html&gt;\" style=\"position:absolute;width:100%;height:100%;left:0;top:0;border:none !important;\" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe></div></div>"
      ],
      "text/plain": [
       "<folium.folium.Map at 0x7f9184b63910>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Create a folium map centered at CBD\n",
    "map_graph = folium.Map(location=shagnhai_cbd, zoom_start=20)\n",
    "\n",
    "points_subscriber = [\n",
    "\n",
    "    (31.235231, 121.505123, \"sub-9\"),\n",
    "    (31.235431, 121.506163, \"sub-10\"),\n",
    "]\n",
    "\n",
    "points_place = [\n",
    "    # JinMao Building\n",
    "    (31.2353, 121.5057, \"Jinmao Building\"),\n",
    "]\n",
    "\n",
    "\n",
    "draw_circle(map_graph, points_place, 0.1)\n",
    "draw_points(map_graph, points_subscriber)\n",
    "draw_points(map_graph, points_place, color='blue', icon='home')\n",
    "draw_connections(map_graph, points_subscriber, points_place)\n",
    "\n",
    "from IPython.display import display\n",
    "display(map_graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25b5d312-5e77-4456-8cc2-3a1c74e3c6a7",
   "metadata": {},
   "source": [
    "可以看到，sub-9、sub-10 两个 CDB 区域长期漫游的用户，我们可以中通过**曾经是 C9** 并且**“学生智能”**的多维度画像，得出有限推荐高增值服务的目标用户"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "9e478b4c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ID</th>\n",
       "      <th>MSISDN</th>\n",
       "      <th>Name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>sub-10</td>\n",
       "      <td>13900000011</td>\n",
       "      <td>Mia Garcia</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       ID       MSISDN        Name\n",
       "0  sub-10  13900000011  Mia Garcia"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "MATCH (sub:subscriber)-[:stays_in]->(place:place)\n",
    "    WHERE\n",
    "       ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5057 31.2353)\") # CBD\n",
    "                ) < 5000\n",
    "WITH sub, place\n",
    "\n",
    "MATCH (:profile{name: \"Student Smart Phone\"})<-[was:was]-(sub:subscriber)-[:was]->(:profile{name: \"C9\"})\n",
    "RETURN id(sub) AS ID, sub.subscriber.msisdn AS MSISDN, sub.subscriber.name AS Name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "0ed384ff-b78a-4a87-9391-9eeca8c12ae4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>p1</th>\n",
       "      <th>p2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(\"sub-10\" :subscriber{msisdn: 13900000011, nam...</td>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "      <td>(\"place-4\" :place{name: \"Jinmao Building\", cit...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(\"sub-10\" :subscriber{msisdn: 13900000011, nam...</td>\n",
       "      <td>(\"profile-2\" :profile{name: \"Student Smart Pho...</td>\n",
       "      <td>(\"place-0\" :place{name: \"Fudan University\", ci...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   p  \\\n",
       "0  (\"sub-10\" :subscriber{msisdn: 13900000011, nam...   \n",
       "1  (\"sub-10\" :subscriber{msisdn: 13900000011, nam...   \n",
       "\n",
       "                                                  p1  \\\n",
       "0  (\"profile-2\" :profile{name: \"Student Smart Pho...   \n",
       "1  (\"profile-2\" :profile{name: \"Student Smart Pho...   \n",
       "\n",
       "                                                  p2  \n",
       "0  (\"place-4\" :place{name: \"Jinmao Building\", cit...  \n",
       "1  (\"place-0\" :place{name: \"Fudan University\", ci...  "
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%ngql\n",
    "\n",
    "# 图可解释\n",
    "\n",
    "MATCH p=(sub:subscriber)-[:stays_in]->(place:place)\n",
    "    WHERE\n",
    "       ST_Distance(place.place.geo_point,\n",
    "                ST_GeogFromText(\"POINT (121.5057 31.2353)\") # CBD\n",
    "                ) < 5000\n",
    "WITH sub, place, p\n",
    "MATCH p1=(:profile{name: \"Student Smart Phone\"})<-[was:was]-(sub:subscriber)-[:was]->(:profile{name: \"C9\"})\n",
    "OPTIONAL MATCH p2=(region:place)<-[:in_region_of]-(:place)<-[:stays_in]-(sub:subscriber)-[:owned_device]->(:device)-[:with_model]->(model:device_model)\n",
    "RETURN p, p1, p2\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "62e325ab-8b72-47e8-8089-a45648c2f4ef",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "nebulagraph_draw.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"500px\"\n",
       "            src=\"nebulagraph_draw.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f9184b693a0>"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%ng_draw"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "5d22a954-a803-4f36-af47-e0b76570d734",
   "metadata": {},
   "outputs": [],
   "source": [
    "!mv nebulagraph_draw.html ng_draw_3.2.html"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
